espressif/arduino-esp32/tests/validation/uart/uart.ino
/* UART test
 *
 * This test is using UART0 (Serial) only for reporting test status and helping with the auto
 * baudrate detection test.
 * The other serials are used for testing.
 */

// Default pins:
//          |  Name   | ESP32 | S2 | S3 | C3 | C6 | H2 | P4 |
// UART0 RX | SOC_RX0 |   3   | 44 | 44 | 20 | 17 | 23 | 38 |
// UART0 TX | SOC_TX0 |   1   | 43 | 43 | 21 | 16 | 24 | 37 |
// UART1 RX |   RX1   |  26   |  4 | 15 | 18 |  4 |  0 | 11 |
// UART1 TX |   TX1   |  27   |  5 | 16 | 19 |  5 |  1 | 10 |
// UART2 RX |   RX2   |   4   | -- | 19 | -- | -- | -- | -- |
// UART2 TX |   TX2   |  25   | -- | 20 | -- | -- | -- | -- |

/*
 * For each UART:
 *
 *           terminal
 *          |       ^
 *          v UART0 |
 *          RX  ^  TX
 *              |
 *        report status
 *              |
 *         TX <---> RX
 *            UARTx
 */

#include <Arduino.h>
#include <vector>
#include <unity.h>
#include "HardwareSerial.h"
#include "esp_rom_gpio.h"
#include "esp32-hal-periman.h"
#include "driver/gpio.h"
#include "hal/gpio_types.h"
#include "Wire.h"

/* Utility defines */

#define TEST_UART_NUM (uart_test_configs.size())

/* Utility classes */

class UARTTestConfig {
public:
  int uart_num;
  HardwareSerial &serial;
  int peeked_char;
  int8_t default_rx_pin;
  int8_t default_tx_pin;
  String recv_msg;

  UARTTestConfig(int num, HardwareSerial &serial_ref, int8_t rx_pin, int8_t tx_pin)
    : uart_num(num), serial(serial_ref), peeked_char(-1), default_rx_pin(rx_pin), default_tx_pin(tx_pin), recv_msg("") {}

  void begin(unsigned long baudrate) {
    // pinMode clears the peripheral bus and detaches UART RX when Serial is already running.
    // Internal RX pull is applied by the driver on begin(); only pre-configure GPIO when stopped.
    if (!serial) {
      pinMode(default_rx_pin, INPUT_PULLUP);
    }
    serial.begin(baudrate, SERIAL_8N1, default_rx_pin, default_tx_pin);
    while (!serial) {
      delay(10);
    }
  }

  void end() {
    serial.end();
  }

  void reset_buffers() {
    recv_msg = "";
    peeked_char = -1;
  }

  void clear_rx_buffer() {
    // Drain any pending bytes from RX before starting a new assertion window.
    while (serial.available()) {
      serial.read();
    }
  }

  void transmit_and_check_msg(const String &msg_append, bool perform_assert = true) {
    const String expected = "Hello from Serial" + String(uart_num) + " " + msg_append;
    const int8_t rx_pin = uart_get_RxPin(uart_num);
    uart_internal_loopback(uart_num, rx_pin);
    reset_buffers();
    clear_rx_buffer();
    delay(10);
    serial.print(expected);
    serial.flush();
    uint32_t start = millis();
    while (millis() - start < 500) {
      while (serial.available()) {
        onReceive();
      }
      if (recv_msg.length() >= expected.length()) {
        break;
      }
      delay(5);
    }
    if (perform_assert && recv_msg != expected) {
      Serial.printf(
        "UART%d diag: rx=%d tx=%d avail=%u got='%s'\n", uart_num, rx_pin, uart_get_TxPin(uart_num), serial.available(), recv_msg.c_str()
      );
      Serial.flush();
    }
    if (perform_assert) {
      TEST_ASSERT_EQUAL_STRING(expected.c_str(), recv_msg.c_str());
      log_d("UART%d received message: %s\n", uart_num, recv_msg.c_str());
    }
  }

  void onReceive() {
    char c;
    size_t available = serial.available();
    if (peeked_char == -1) {
      peeked_char = serial.peek();
    }
    while (available--) {
      c = (char)serial.read();
      if (c > 31 && c < 128) {
        recv_msg += c;
#if 0
      } else {
        Serial.printf("UART%d onReceive() got a non readable character 0x%x='%c'\r\n", uart_num, c, c);
        Serial.flush();
#endif
      }
    }
  }
};

/* Utility global variables */

// Alternate Serial1 split-pin pads from the board I2C bus (pins_arduino.h: SDA/SCL).
static const int8_t NEW_RX1 = SDA;
static const int8_t NEW_TX1 = SCL;

// One-wire tests use SCL so they never share a GPIO with split-pin RX (SDA) in the same
// test step. Sequential stages may reuse pads after end()/begin() (see same_pin_split_transition_test).
static const int8_t TEST_AUX_PIN = SCL;

static_assert(NEW_RX1 != NEW_TX1, "UART test alternate RX/TX pins (SDA/SCL) must differ");
static_assert(NEW_RX1 != RX1 && NEW_RX1 != TX1, "SDA must not overlap Serial1 default pins on this board");
static_assert(NEW_TX1 != RX1 && NEW_TX1 != TX1, "SCL must not overlap Serial1 default pins on this board");
#if defined(RX2) && defined(TX2)
static_assert(NEW_RX1 != RX2 && NEW_RX1 != TX2, "SDA must not overlap Serial2 default pins on this board");
static_assert(NEW_TX1 != RX2 && NEW_TX1 != TX2, "SCL must not overlap Serial2 default pins on this board");
#endif

std::vector<UARTTestConfig *> uart_test_configs;

static gpio_pull_mode_t read_rx_pull_mode(int8_t gpio) {
  gpio_io_config_t cfg = {};
  if (gpio_get_io_config((gpio_num_t)gpio, &cfg) != ESP_OK) {
    return GPIO_FLOATING;
  }
  if (cfg.pu && cfg.pd) {
    return GPIO_PULLUP_PULLDOWN;
  }
  if (cfg.pu) {
    return GPIO_PULLUP_ONLY;
  }
  if (cfg.pd) {
    return GPIO_PULLDOWN_ONLY;
  }
  return GPIO_FLOATING;
}

static void reset_serial_pin_options(HardwareSerial &s) {
  s.enableRxInternalPull(true);
}

static void test_serial_begin(HardwareSerial &s, int8_t rx, int8_t tx, unsigned long baud = 115200, bool invert = false) {
  s.end();
  s.setPins(rx, tx);
  s.begin(baud, SERIAL_8N1, rx, tx, invert);
  while (!s) {
    delay(10);
  }
}

static void uart_test_register_on_receive(UARTTestConfig &config) {
  UARTTestConfig *cfg = &config;
  config.serial.onReceive([cfg]() {
    cfg->onReceive();
  });
}

static void uart_test_init_config(UARTTestConfig &config, unsigned long baudrate = 115200) {
  config.end();
  config.begin(baudrate);
  uart_test_register_on_receive(config);
  uart_internal_loopback(config.uart_num, uart_get_RxPin(config.uart_num));
}

extern "C" int8_t uart_get_RxPin(uint8_t uart_num);
extern "C" int8_t uart_get_TxPin(uint8_t uart_num);

/* Tasks */

// This task is used to send a message after a delay to test the auto baudrate detection
void task_delayed_msg(void *pvParameters) {
  HardwareSerial &selected_serial = uart_test_configs.size() == 1 ? Serial : Serial1;
  delay(1500);
  selected_serial.println("Hello to detect baudrate");
  selected_serial.flush();
  vTaskDelete(NULL);
}

/* Unity functions */

// This function is automatically called by unity before each test is run
void setUp(void) {
  for (auto *ref : uart_test_configs) {
    uart_test_init_config(*ref);
  }
}

// This function is automatically called by unity after each test is run
void tearDown(void) {
  for (auto *ref : uart_test_configs) {
    UARTTestConfig &config = *ref;
    config.end();
  }
}

/* Test functions */

// This test checks if a message can be transmitted and received correctly using the default settings
void basic_transmission_test(void) {
  log_d("Performing basic transmission test");

  for (auto *ref : uart_test_configs) {
    UARTTestConfig &config = *ref;
    config.transmit_and_check_msg("");
  }

  Serial.println("Basic transmission test successful");
}

// This test checks if the baudrate can be changed and if the message can be transmitted and received correctly after the change
void change_baudrate_test(void) {
  for (auto *ref : uart_test_configs) {
    UARTTestConfig &config = *ref;
    log_d("Changing baudrate of UART%d to 9600", config.uart_num);

    //Baudrate error should be within 2% of the target baudrate
    config.serial.updateBaudRate(9600);
    TEST_ASSERT_UINT_WITHIN(192, 9600, config.serial.baudRate());

