espressif/arduino-esp32/tests/validation/uart/uart.ino
  log_d("Checking if Serial 1 event queue can be reset when stopped");
  Serial1.eventQueueReset();

  log_d("Checking if Serial 1 can be flushed when stopped");
  Serial1.flush();

  log_d("Checking if Serial 1 debug output can be enabled when stopped");
  Serial1.setDebugOutput(true);
  Serial1.setDebugOutput(false);
  Serial.setDebugOutput(true);  // restore the Console log output

  log_d("Checking if Serial 1 RX can be inverted when stopped");
  Serial1.setRxInvert(true);
  Serial1.setRxInvert(false);

  log_d("Checking if Serial 1 TX can be inverted when stopped");
  Serial1.setTxInvert(true);
  Serial1.setTxInvert(false);

  log_d("Checking if Serial 1 pin options can be set when stopped");
  TEST_ASSERT_TRUE(Serial1.enableRxInternalPull(true));
  reset_serial_pin_options(Serial1);

  Serial.println("Disabled UART calls test successful");
}

// This test checks if the pins can be changed and if the message can be transmitted and received correctly after the change
void change_pins_test(void) {
  log_d("Disabling UART loopback");

  for (auto *ref : uart_test_configs) {
    UARTTestConfig &config = *ref;
    esp_rom_gpio_connect_out_signal(config.default_rx_pin, SIG_GPIO_OUT_IDX, false, false);
  }

  log_d("Swapping UART pins and testing transmission");

  if (TEST_UART_NUM == 1) {
    UARTTestConfig &config = *uart_test_configs[0];
    // pinMode will force enabling the internal pullup resistor (IDF 5.3.2 Change)
    pinMode(NEW_RX1, INPUT_PULLUP);
    // Detaching both pins will result in stopping the UART driver
    // Only detach one of the pins
    config.serial.setPins(NEW_RX1, /*NEW_TX1*/ -1);
    TEST_ASSERT_EQUAL(NEW_RX1, uart_get_RxPin(config.uart_num));
    //TEST_ASSERT_EQUAL(NEW_TX1, uart_get_TxPin(config.uart_num));

    uart_internal_loopback(config.uart_num, NEW_RX1);
    uart_test_register_on_receive(config);
    config.transmit_and_check_msg("using new pins");
  } else {
    for (int i = 0; i < TEST_UART_NUM; i++) {
      UARTTestConfig &config = *uart_test_configs[i];
      UARTTestConfig &next_uart = *uart_test_configs[(i + 1) % TEST_UART_NUM];
      // Detaching both pins will result in stopping the UART driver
      // Only detach one of the pins
      config.serial.setPins(next_uart.default_rx_pin, /*next_uart.default_tx_pin*/ -1);
      TEST_ASSERT_EQUAL(uart_get_RxPin(config.uart_num), next_uart.default_rx_pin);
      //TEST_ASSERT_EQUAL(uart_get_TxPin(config.uart_num), next_uart.default_tx_pin);

      uart_internal_loopback(config.uart_num, next_uart.default_rx_pin);
      uart_test_register_on_receive(config);
      config.transmit_and_check_msg("using new pins");
    }
  }

  Serial.println("Change pins test successful");
}

// This test checks if the auto baudrate detection works on ESP32 and ESP32-S2
#if CONFIG_IDF_TARGET_ESP32 || CONFIG_IDF_TARGET_ESP32S2
void auto_baudrate_test(void) {
  log_d("Starting auto baudrate test");

  HardwareSerial *selected_serial;
  unsigned long baudrate;

  log_d("Stopping test serial. Using Serial2 for ESP32 and Serial1 for ESP32-S2.");

  if (TEST_UART_NUM == 1) {
    selected_serial = &Serial1;
    uart_internal_loopback(0, RX1);
  } else {
#ifdef RX2
    selected_serial = &Serial2;
    uart_internal_loopback(1, RX2);
#endif
  }

  //selected_serial->end(false);

  log_d("Starting delayed task to send message");

  xTaskCreate(task_delayed_msg, "task_delayed_msg", 2048, NULL, 2, NULL);

  log_d("Starting serial with auto baudrate detection");

  selected_serial->begin(0);
  baudrate = selected_serial->baudRate();

  if (TEST_UART_NUM == 1) {
    Serial.end();
    Serial.begin(115200);
    Serial.setDebugOutput(true);
  }

  TEST_ASSERT_UINT_WITHIN(2304, 115200, baudrate);

  Serial.println("Auto baudrate test successful");
}
#endif

// This test checks if the peripheral manager can properly manage UART pins
void periman_test(void) {
  log_d("Checking if peripheral manager can properly manage UART pins");

  Wire.end();

  log_d("Setting up I2C on the same pins as UART");

  for (auto *ref : uart_test_configs) {
    UARTTestConfig &config = *ref;
    // Detaching both pins will result in stopping the UART driver
    // Only detach one of the pins
    Wire.begin(config.default_rx_pin, /*config.default_tx_pin*/ -1);
    config.recv_msg = "";

    log_d("Trying to send message using UART%d with I2C enabled", config.uart_num);
    config.transmit_and_check_msg("while used by I2C", false);
    TEST_ASSERT_EQUAL_STRING("", config.recv_msg.c_str());

    log_d("Disabling I2C and re-enabling UART%d", config.uart_num);

    Wire.end();
    config.serial.setPins(config.default_rx_pin, config.default_tx_pin);
    uart_test_register_on_receive(config);
    uart_internal_loopback(config.uart_num, config.default_rx_pin);

    log_d("Trying to send message using UART%d with I2C disabled", config.uart_num);
    config.transmit_and_check_msg("while I2C is disabled");
  }

  Wire.end();

  Serial.println("Peripheral manager test successful");
}

// This test checks if messages can be transmitted and received correctly after changing the CPU frequency
void change_cpu_frequency_test(void) {
  uint32_t old_freq = getCpuFrequencyMhz();
  uint32_t new_freq = getXtalFrequencyMhz();

  log_d("Changing CPU frequency from %" PRIu32 "MHz to %" PRIu32 "MHz", old_freq, new_freq);
  Serial.flush();
  setCpuFrequencyMhz(new_freq);

  Serial.updateBaudRate(115200);

  for (auto *ref : uart_test_configs) {
    UARTTestConfig &config = *ref;
    log_d("Trying to send message with the new CPU frequency on UART%d", config.uart_num);
    config.transmit_and_check_msg("with new CPU frequency");
  }

  log_d("Changing CPU frequency back to %" PRIu32 "MHz", old_freq);
  Serial.flush();
  setCpuFrequencyMhz(old_freq);

  Serial.updateBaudRate(115200);

  for (auto *ref : uart_test_configs) {
    UARTTestConfig &config = *ref;
    log_d("Trying to send message with the original CPU frequency on UART%d", config.uart_num);
    config.transmit_and_check_msg("with the original CPU frequency");
  }

  Serial.println("Change CPU frequency test successful");
}

// This test checks if hardware flow control (RTS/CTS) works correctly with internal loopback
void hardware_flow_control_test(void) {
  log_d("Starting hardware flow control test");

  // Use board I2C pads (SDA/SCL) for CTS/RTS; default RX/TX stay on UART1 pins.
  const int8_t TEST_RTS_PIN = NEW_TX1;
  const int8_t TEST_CTS_PIN = NEW_RX1;

  for (auto *ref : uart_test_configs) {
    UARTTestConfig &config = *ref;

    // Configure pins with CTS and RTS (can be called after begin())
    log_d("Setting UART%d pins: RX=%d, TX=%d, CTS=%d, RTS=%d", config.uart_num, config.default_rx_pin, config.default_tx_pin, TEST_CTS_PIN, TEST_RTS_PIN);
    bool pins_set = config.serial.setPins(config.default_rx_pin, config.default_tx_pin, TEST_CTS_PIN, TEST_RTS_PIN);
    TEST_ASSERT_TRUE(pins_set);

    // Enable hardware flow control
    log_d("Enabling hardware flow control (RTS + CTS)");
    bool flow_ctrl_set = config.serial.setHwFlowCtrlMode(UART_HW_FLOWCTRL_CTS_RTS, 64);
    TEST_ASSERT_TRUE(flow_ctrl_set);

    // Set up internal loopbacks: TX->RX and RTS->CTS
    log_d("Setting up internal loopbacks: TX->RX and RTS->CTS");
    uart_internal_loopback(config.uart_num, config.default_rx_pin);
    uart_internal_hw_flow_ctrl_loopback(config.uart_num, TEST_CTS_PIN);
    uart_test_register_on_receive(config);

