espressif/arduino-esp32/tests/validation/uart/uart.ino
    delay(100);
    config.transmit_and_check_msg("Hardware Flow Control ON");

    // Test that flow control can be disabled
    log_d("Testing disabling hardware flow control");
    bool flow_ctrl_disabled = config.serial.setHwFlowCtrlMode(UART_HW_FLOWCTRL_DISABLE, 64);
    TEST_ASSERT_TRUE(flow_ctrl_disabled);

    // Test transmission still works after disabling flow control
    delay(50);
    config.transmit_and_check_msg("Hardware Flow Control OFF");
  }

  Serial.println("Hardware flow control test successful");
}

// This test checks if IRDA mode (setMode and setIrdaDirection) works correctly
void irda_mode_test(void) {
  log_d("Starting IRDA mode test");

  for (auto *ref : uart_test_configs) {
    UARTTestConfig &config = *ref;

    // Test 1: Verify setIrdaDirection fails when IRDA mode is not enabled
    log_d("Verifying UART%d rejects IRDA TX mode while in regular UART mode", config.uart_num);
    bool mode_set = config.serial.setMode(UART_MODE_UART);
    TEST_ASSERT_TRUE(mode_set);
    bool irda_tx_set = config.serial.setIrdaDirection(ESP32_UART_IRDA_TX);
    TEST_ASSERT_FALSE(irda_tx_set);

    // Test 2: Enable IRDA mode
    log_d("Setting UART%d to IRDA mode", config.uart_num);
    mode_set = config.serial.setMode(UART_MODE_IRDA);
    TEST_ASSERT_TRUE(mode_set);

    // Test 3: Set IRDA TX mode
    log_d("Setting UART%d to IRDA TX mode (transmit)", config.uart_num);
    irda_tx_set = config.serial.setIrdaDirection(ESP32_UART_IRDA_TX);
    TEST_ASSERT_TRUE(irda_tx_set);

    delay(50);

    // Test 4: Set IRDA RX mode
    log_d("Setting UART%d to IRDA RX mode (receive)", config.uart_num);
    bool irda_rx_set = config.serial.setIrdaDirection(ESP32_UART_IRDA_RX);
    TEST_ASSERT_TRUE(irda_rx_set);

    delay(50);

    // Test 5: Switch back to TX mode
    log_d("Switching UART%d back to IRDA TX mode", config.uart_num);
    irda_tx_set = config.serial.setIrdaDirection(ESP32_UART_IRDA_TX);
    TEST_ASSERT_TRUE(irda_tx_set);

    // Test 6: Return to regular UART mode for next tests
    log_d("Setting UART%d back to regular UART mode", config.uart_num);
    mode_set = config.serial.setMode(UART_MODE_UART);
    TEST_ASSERT_TRUE(mode_set);
  }

  // Functional behavior test with two UARTs:
  // UART A in IRDA RX mode should receive UART B data when UART B is in IRDA TX mode.
  // After switching UART A to IRDA TX mode, it should no longer receive UART B data.
  if (TEST_UART_NUM >= 2) {
    UARTTestConfig &uartA = *uart_test_configs[0];
    UARTTestConfig &uartB = *uart_test_configs[1];

    // IrDA uses narrow pulses (3/16 of bit period); at high baud rates
    // the pulses are too short for reliable cross-UART GPIO matrix loopback.
    uartA.serial.updateBaudRate(9600);
    uartB.serial.updateBaudRate(9600);
    delay(500);

    // Set both UARTs to IRDA mode
    bool mode_set = uartA.serial.setMode(UART_MODE_IRDA);
    TEST_ASSERT_TRUE(mode_set);
    mode_set = uartB.serial.setMode(UART_MODE_IRDA);
    TEST_ASSERT_TRUE(mode_set);

    // Configure: UART A in RX mode, UART B in TX mode
    bool irda_rx_set = uartA.serial.setIrdaDirection(ESP32_UART_IRDA_RX);
    TEST_ASSERT_TRUE(irda_rx_set);
    bool irda_tx_set = uartB.serial.setIrdaDirection(ESP32_UART_IRDA_TX);
    TEST_ASSERT_TRUE(irda_tx_set);

    // Set up internal loopback: UART B TX -> UART A RX
    uart_internal_loopback(uartB.uart_num, uartA.default_rx_pin);
    delay(50);

    // Test 1: UART A should receive when in RX mode
    log_d("Testing UART%d reception in IRDA RX mode", uartA.uart_num);
    const char *msg_rx_enabled = "IRDA_RX_ENABLED";
    uartA.reset_buffers();
    uartA.clear_rx_buffer();
    delay(50);
    uartB.serial.print(msg_rx_enabled);
    uartB.serial.flush();
    delay(200);  // Give more time for IRDA hardware to process and callback to fire
    log_d("UART%d received: '%s'", uartA.uart_num, uartA.recv_msg.c_str());
    TEST_ASSERT_EQUAL_STRING(msg_rx_enabled, uartA.recv_msg.c_str());

    // Test 2: Switch UART A to TX mode - should NOT receive
    log_d("Switching UART%d to IRDA TX mode - should no longer receive", uartA.uart_num);
    irda_tx_set = uartA.serial.setIrdaDirection(ESP32_UART_IRDA_TX);
    TEST_ASSERT_TRUE(irda_tx_set);
    delay(50);

    const char *msg_rx_disabled = "IRDA_RX_DISABLED";
    uartA.reset_buffers();
    uartA.clear_rx_buffer();
    delay(50);
    uartB.serial.print(msg_rx_disabled);
    uartB.serial.flush();
    delay(200);  // Give time for any data to arrive (should be none)
    log_d("UART%d received after TX mode switch: '%s' (should be empty)", uartA.uart_num, uartA.recv_msg.c_str());
    TEST_ASSERT_EQUAL(0, uartA.recv_msg.length());

    // Return both UARTs to regular UART mode
    mode_set = uartA.serial.setMode(UART_MODE_UART);
    TEST_ASSERT_TRUE(mode_set);
    mode_set = uartB.serial.setMode(UART_MODE_UART);
    TEST_ASSERT_TRUE(mode_set);
    uart_internal_loopback(uartA.uart_num, uartA.default_rx_pin);
    uart_internal_loopback(uartB.uart_num, uartB.default_rx_pin);
  } else {
    log_d("Skipping functional IRDA direction behavior check: requires at least 2 UARTs");
  }

  Serial.println("IRDA mode test successful");
}

// This test checks that moving both UART RX and TX pins to another UART terminates the source UART
void inter_uart_pin_move_test(void) {
  if (TEST_UART_NUM < 2) {
    TEST_PASS_MESSAGE("Skipping: test requires 2+ UARTs");
    return;
  }

  UARTTestConfig &uart1 = *uart_test_configs[0];
  UARTTestConfig &uart2 = *uart_test_configs[1];

  // Both UARTs should be running at test start (setUp ensures this)
  TEST_ASSERT_TRUE(uart1.serial);
  TEST_ASSERT_TRUE(uart2.serial);

  // Move uart1 to use uart2's default pins: uart2 should be terminated
  log_d("Moving UART%d to use UART%d pins (%d, %d)", uart1.uart_num, uart2.uart_num, uart2.default_rx_pin, uart2.default_tx_pin);
  uart1.serial.setPins(uart2.default_rx_pin, uart2.default_tx_pin);

  // uart2 should now be terminated (it lost both its RX and TX pins)
  TEST_ASSERT_FALSE(uart2.serial);

  // uart1 should still be running and using uart2's former pins
  TEST_ASSERT_TRUE(uart1.serial);
  TEST_ASSERT_EQUAL(uart2.default_rx_pin, uart_get_RxPin(uart1.uart_num));
  TEST_ASSERT_EQUAL(uart2.default_tx_pin, uart_get_TxPin(uart1.uart_num));

