espressif/arduino-esp32/tests/validation/uart/uart.ino
  // Confirm uart1 can still transmit on its new pins
  uart_internal_loopback(uart1.uart_num, uart2.default_rx_pin);
  uart1.transmit_and_check_msg("after inter-UART pin move");

  Serial.println("Inter-UART pin move test successful");
}

// This test checks that swapping RX and TX pins within the same UART keeps it running
void same_uart_pin_swap_test(void) {
  UARTTestConfig &config = *uart_test_configs[0];

  TEST_ASSERT_TRUE(config.serial);

  int8_t orig_rx = config.default_rx_pin;
  int8_t orig_tx = config.default_tx_pin;

  // Swap RX and TX on the same UART
  log_d("Swapping RX(%d) and TX(%d) on UART%d", orig_rx, orig_tx, config.uart_num);
  bool ret = config.serial.setPins(orig_tx, orig_rx);
  TEST_ASSERT_TRUE(ret);

  // UART should still be running after a pin swap
  TEST_ASSERT_TRUE(config.serial);
  TEST_ASSERT_EQUAL(orig_tx, uart_get_RxPin(config.uart_num));
  TEST_ASSERT_EQUAL(orig_rx, uart_get_TxPin(config.uart_num));

  // Confirm transmission still works with swapped pins (re-set loopback for swapped RX)
  uart_internal_loopback(config.uart_num, orig_tx);
  config.transmit_and_check_msg("after pin swap");

  Serial.println("Same UART pin swap test successful");
}

// This test checks that moving a UART's RX/TX to CTS/RTS (same UART) terminates the UART
void move_rx_tx_to_cts_rts_test(void) {
  UARTTestConfig &config = *uart_test_configs[0];

  TEST_ASSERT_TRUE(config.serial);

  // Move the UART's own RX and TX to CTS and RTS – it should no longer have valid RX/TX
  log_d("Moving UART%d RX(%d)/TX(%d) to CTS/RTS", config.uart_num, config.default_rx_pin, config.default_tx_pin);
  config.serial.setPins(-1, -1, config.default_rx_pin, config.default_tx_pin);

  // UART should be terminated because it has no RX or TX pins
  TEST_ASSERT_FALSE(config.serial);

  Serial.println("Move RX/TX to CTS/RTS terminates UART test successful");
}

// This test checks that assigning another UART's RX/TX pins as CTS/RTS terminates the source UART
void cross_uart_cts_rts_test(void) {
  if (TEST_UART_NUM < 2) {
    TEST_PASS_MESSAGE("Skipping: test requires 2+ UARTs");
    return;
  }

  UARTTestConfig &uart1 = *uart_test_configs[0];
  UARTTestConfig &uart2 = *uart_test_configs[1];

  TEST_ASSERT_TRUE(uart1.serial);
  TEST_ASSERT_TRUE(uart2.serial);

  // uart2 takes uart1's RX/TX pins as its CTS/RTS.
  // uart1 should be terminated (lost its only RX and TX pins).
  // uart2 keeps its own RX/TX and additionally gets CTS/RTS.
  log_d("UART%d taking UART%d pins (%d, %d) as CTS/RTS", uart2.uart_num, uart1.uart_num, uart1.default_rx_pin, uart1.default_tx_pin);
  uart2.serial.setPins(-1, -1, uart1.default_rx_pin, uart1.default_tx_pin);

  // uart1 should be terminated (lost its RX and TX)
  TEST_ASSERT_FALSE(uart1.serial);

  // uart2 should still be running (its own RX/TX are untouched)
  TEST_ASSERT_TRUE(uart2.serial);

  // Confirm uart2 can still transmit on its own RX/TX pins
  uart_internal_loopback(uart2.uart_num, uart2.default_rx_pin);
  uart2.transmit_and_check_msg("after cross-UART CTS/RTS assignment");

  Serial.println("Cross-UART CTS/RTS terminates source UART test successful");
}

void rx_pull_pre_begin_api_test(void) {
  log_d("RX pull API must be pre-begin only");

  Serial1.end();
  reset_serial_pin_options(Serial1);
  TEST_ASSERT_TRUE(Serial1.enableRxInternalPull(true));

  test_serial_begin(Serial1, NEW_RX1, NEW_TX1);
  TEST_ASSERT_FALSE(Serial1.enableRxInternalPull(true));
  Serial1.end();

  Serial.println("RX pull pre-begin API test successful");
}

void rx_pull_inversion_test(void) {
  log_d("RX internal pull vs inversion");

  Serial1.end();
  reset_serial_pin_options(Serial1);

  test_serial_begin(Serial1, NEW_RX1, NEW_TX1);
  TEST_ASSERT_EQUAL(GPIO_PULLUP_ONLY, read_rx_pull_mode(NEW_RX1));
  Serial1.end();

  test_serial_begin(Serial1, NEW_RX1, NEW_TX1, 115200, true);
  TEST_ASSERT_EQUAL(GPIO_PULLDOWN_ONLY, read_rx_pull_mode(NEW_RX1));
  Serial1.end();

  test_serial_begin(Serial1, NEW_RX1, NEW_TX1);
  Serial1.setRxInvert(true);
  TEST_ASSERT_EQUAL(GPIO_PULLDOWN_ONLY, read_rx_pull_mode(NEW_RX1));
  Serial1.end();

  test_serial_begin(Serial1, NEW_RX1, NEW_TX1, 115200, true);
  Serial1.setRxInvert(false);
  TEST_ASSERT_EQUAL(GPIO_PULLUP_ONLY, read_rx_pull_mode(NEW_RX1));
  Serial1.end();

  test_serial_begin(Serial1, NEW_RX1, NEW_TX1);
  Serial1.setTxInvert(true);
  TEST_ASSERT_EQUAL(GPIO_PULLUP_ONLY, read_rx_pull_mode(NEW_RX1));
  Serial1.end();

  Serial1.end();
  reset_serial_pin_options(Serial1);
  Serial1.enableRxInternalPull(false);
  test_serial_begin(Serial1, NEW_RX1, NEW_TX1);
  TEST_ASSERT_EQUAL(GPIO_FLOATING, read_rx_pull_mode(NEW_RX1));
  Serial1.end();

  Serial.println("RX pull inversion test successful");
}

void same_pin_validation_test(void) {
  log_d("Same-pin auto-detects one-wire; -1 keep-current also enables it");

  Serial1.end();
  reset_serial_pin_options(Serial1);
  TEST_ASSERT_TRUE(Serial1.setPins(TEST_AUX_PIN, TEST_AUX_PIN));
  TEST_ASSERT_EQUAL(TEST_AUX_PIN, uart_get_RxPin(1));
  TEST_ASSERT_EQUAL(TEST_AUX_PIN, uart_get_TxPin(1));
  Serial1.end();

  // Explicit (p, p) then begin: shared periman type
  test_serial_begin(Serial1, NEW_RX1, NEW_TX1);
  TEST_ASSERT_FALSE(Serial1.setPins(TEST_AUX_PIN, TEST_AUX_PIN, TEST_AUX_PIN, -1));
  TEST_ASSERT_FALSE(Serial1.setPins(TEST_AUX_PIN, TEST_AUX_PIN, -1, TEST_AUX_PIN));
  TEST_ASSERT_TRUE(Serial1);
  TEST_ASSERT_EQUAL(NEW_RX1, uart_get_RxPin(1));
  TEST_ASSERT_EQUAL(NEW_TX1, uart_get_TxPin(1));
  TEST_ASSERT_TRUE(Serial1.setPins(TEST_AUX_PIN, TEST_AUX_PIN));
  TEST_ASSERT_EQUAL(ESP32_BUS_TYPE_UART_RX_TX, perimanGetPinBusType(TEST_AUX_PIN));
  TEST_ASSERT_EQUAL(TEST_AUX_PIN, uart_get_RxPin(1));
  TEST_ASSERT_EQUAL(TEST_AUX_PIN, uart_get_TxPin(1));
  TEST_ASSERT_FALSE(Serial1.setPins(-1, -1, TEST_AUX_PIN, -1));
  TEST_ASSERT_FALSE(Serial1.setPins(-1, -1, -1, TEST_AUX_PIN));
  TEST_ASSERT_TRUE(Serial1);
  TEST_ASSERT_EQUAL(ESP32_BUS_TYPE_UART_RX_TX, perimanGetPinBusType(TEST_AUX_PIN));

  // Keeping both data pins while adding CTS must preserve one-wire ownership and the driver.
  TEST_ASSERT_TRUE(Serial1.setPins(-1, -1));
  TEST_ASSERT_TRUE(Serial1);
  TEST_ASSERT_EQUAL(ESP32_BUS_TYPE_UART_RX_TX, perimanGetPinBusType(TEST_AUX_PIN));
  TEST_ASSERT_TRUE(Serial1.setPins(-1, -1, NEW_RX1, -1));
  TEST_ASSERT_TRUE(Serial1);
  TEST_ASSERT_EQUAL(TEST_AUX_PIN, uart_get_RxPin(1));
  TEST_ASSERT_EQUAL(TEST_AUX_PIN, uart_get_TxPin(1));
  TEST_ASSERT_EQUAL(ESP32_BUS_TYPE_UART_RX_TX, perimanGetPinBusType(TEST_AUX_PIN));
  TEST_ASSERT_EQUAL(ESP32_BUS_TYPE_UART_CTS, perimanGetPinBusType(NEW_RX1));
  Serial1.end();

  // Back to split, then implicit one-wire via setPins(-1, currentRx)
  test_serial_begin(Serial1, NEW_RX1, NEW_TX1);
  TEST_ASSERT_TRUE(Serial1.setPins(-1, NEW_RX1));
  TEST_ASSERT_EQUAL(NEW_RX1, uart_get_RxPin(1));
  TEST_ASSERT_EQUAL(NEW_RX1, uart_get_TxPin(1));
  TEST_ASSERT_EQUAL(ESP32_BUS_TYPE_UART_RX_TX, perimanGetPinBusType(NEW_RX1));
  TEST_ASSERT_EQUAL(ESP32_BUS_TYPE_INIT, perimanGetPinBusType(NEW_TX1));
  TEST_ASSERT_EQUAL(GPIO_FLOATING, read_rx_pull_mode(NEW_RX1));

  // Leave one-wire while keeping RX via -1; the kept RX must regain its pull.
  TEST_ASSERT_TRUE(Serial1.setPins(-1, NEW_TX1));
  TEST_ASSERT_TRUE(Serial1);
  TEST_ASSERT_EQUAL(NEW_RX1, uart_get_RxPin(1));
  TEST_ASSERT_EQUAL(NEW_TX1, uart_get_TxPin(1));
  TEST_ASSERT_EQUAL(ESP32_BUS_TYPE_UART_RX, perimanGetPinBusType(NEW_RX1));
  TEST_ASSERT_EQUAL(ESP32_BUS_TYPE_UART_TX, perimanGetPinBusType(NEW_TX1));
  TEST_ASSERT_EQUAL(GPIO_PULLUP_ONLY, read_rx_pull_mode(NEW_RX1));

  // Enter through the other implicit form, then leave while keeping TX via -1.
  TEST_ASSERT_TRUE(Serial1.setPins(NEW_TX1, -1));
  TEST_ASSERT_EQUAL(NEW_TX1, uart_get_RxPin(1));
  TEST_ASSERT_EQUAL(NEW_TX1, uart_get_TxPin(1));
  TEST_ASSERT_EQUAL(ESP32_BUS_TYPE_UART_RX_TX, perimanGetPinBusType(NEW_TX1));
  TEST_ASSERT_EQUAL(ESP32_BUS_TYPE_INIT, perimanGetPinBusType(NEW_RX1));
  TEST_ASSERT_EQUAL(GPIO_FLOATING, read_rx_pull_mode(NEW_TX1));
  TEST_ASSERT_TRUE(Serial1.setPins(NEW_RX1, -1));
  TEST_ASSERT_TRUE(Serial1);
  TEST_ASSERT_EQUAL(NEW_RX1, uart_get_RxPin(1));
  TEST_ASSERT_EQUAL(NEW_TX1, uart_get_TxPin(1));
  TEST_ASSERT_EQUAL(ESP32_BUS_TYPE_UART_RX, perimanGetPinBusType(NEW_RX1));
  TEST_ASSERT_EQUAL(ESP32_BUS_TYPE_UART_TX, perimanGetPinBusType(NEW_TX1));
  TEST_ASSERT_EQUAL(GPIO_PULLUP_ONLY, read_rx_pull_mode(NEW_RX1));

  // Explicit split -> one-wire collapsing onto the former RX pad, then re-expand to split.
  TEST_ASSERT_TRUE(Serial1.setPins(NEW_RX1, NEW_RX1));
  TEST_ASSERT_TRUE(Serial1);
  TEST_ASSERT_EQUAL(NEW_RX1, uart_get_RxPin(1));
  TEST_ASSERT_EQUAL(NEW_RX1, uart_get_TxPin(1));
  TEST_ASSERT_EQUAL(ESP32_BUS_TYPE_UART_RX_TX, perimanGetPinBusType(NEW_RX1));
  TEST_ASSERT_EQUAL(ESP32_BUS_TYPE_INIT, perimanGetPinBusType(NEW_TX1));
  TEST_ASSERT_EQUAL(GPIO_FLOATING, read_rx_pull_mode(NEW_RX1));
  TEST_ASSERT_TRUE(Serial1.setPins(NEW_RX1, NEW_TX1));
  TEST_ASSERT_TRUE(Serial1);
  TEST_ASSERT_EQUAL(NEW_RX1, uart_get_RxPin(1));
  TEST_ASSERT_EQUAL(NEW_TX1, uart_get_TxPin(1));
  TEST_ASSERT_EQUAL(ESP32_BUS_TYPE_UART_RX, perimanGetPinBusType(NEW_RX1));
  TEST_ASSERT_EQUAL(ESP32_BUS_TYPE_UART_TX, perimanGetPinBusType(NEW_TX1));
  TEST_ASSERT_EQUAL(GPIO_PULLUP_ONLY, read_rx_pull_mode(NEW_RX1));
  Serial1.end();

