espressif/arduino-esp32/tests/validation/uart/uart.ino
  Serial.println("Same-pin validation test successful");
}

void same_pin_pull_disabled_test(void) {
  log_d("One-wire mode disables RX internal pull");

  Serial1.end();
  reset_serial_pin_options(Serial1);
  test_serial_begin(Serial1, TEST_AUX_PIN, TEST_AUX_PIN, 115200, true);
  TEST_ASSERT_EQUAL(GPIO_FLOATING, read_rx_pull_mode(TEST_AUX_PIN));
  Serial1.end();

  Serial.println("Same-pin pull disabled test successful");
}

void same_pin_transmission_test(void) {
  log_d("One-wire UART echo on shared pin");

  Serial1.end();
  String recv;
  reset_serial_pin_options(Serial1);
  test_serial_begin(Serial1, TEST_AUX_PIN, TEST_AUX_PIN);
  Serial1.onReceive([&recv]() {
    while (Serial1.available()) {
      char c = Serial1.read();
      if (c > 31 && c < 128) {
        recv += c;
      }
    }
  });
  uart_internal_loopback(1, TEST_AUX_PIN);
  delay(50);
  recv = "";
  Serial1.print("ONEWIRE");
  Serial1.flush();
  delay(150);
  TEST_ASSERT_EQUAL_STRING("ONEWIRE", recv.c_str());
  Serial1.end();

  Serial.println("Same-pin transmission test successful");
}

void same_pin_periman_test(void) {
  log_d("One-wire pin uses UART_RX_TX periman type; external deinit terminates UART");

  Serial1.end();
  reset_serial_pin_options(Serial1);
  test_serial_begin(Serial1, TEST_AUX_PIN, TEST_AUX_PIN);
  TEST_ASSERT_EQUAL(ESP32_BUS_TYPE_UART_RX_TX, perimanGetPinBusType(TEST_AUX_PIN));
  TEST_ASSERT_TRUE(Serial1);

  pinMode(TEST_AUX_PIN, INPUT);
  delay(50);
  TEST_ASSERT_FALSE(Serial1);
  Serial1.end();

  Serial.println("Same-pin periman test successful");
}

void same_pin_mode_rejection_test(void) {
  log_d("RS485 and IrDA reject same-pin configuration; setMode rejects active one-wire");

  Serial1.end();
  reset_serial_pin_options(Serial1);
  test_serial_begin(Serial1, NEW_RX1, NEW_TX1);

  TEST_ASSERT_TRUE(Serial1.setMode(UART_MODE_RS485_HALF_DUPLEX));
  TEST_ASSERT_FALSE(Serial1.setPins(TEST_AUX_PIN, TEST_AUX_PIN));

  TEST_ASSERT_TRUE(Serial1.setMode(UART_MODE_UART));
  TEST_ASSERT_TRUE(Serial1.setMode(UART_MODE_IRDA));
  TEST_ASSERT_FALSE(Serial1.setPins(TEST_AUX_PIN, TEST_AUX_PIN));

  TEST_ASSERT_TRUE(Serial1.setMode(UART_MODE_UART));
  TEST_ASSERT_TRUE(Serial1.setPins(TEST_AUX_PIN, TEST_AUX_PIN));
  TEST_ASSERT_FALSE(Serial1.setMode(UART_MODE_RS485_HALF_DUPLEX));
  TEST_ASSERT_FALSE(Serial1.setMode(UART_MODE_IRDA));
  TEST_ASSERT_TRUE(Serial1.setMode(UART_MODE_UART));
  Serial1.end();

  Serial.println("Same-pin mode rejection test successful");
}

void same_pin_split_transition_test(void) {
  log_d("Split <-> one-wire transitions keep driver alive");

  Serial1.end();
  String recv;
  reset_serial_pin_options(Serial1);
  test_serial_begin(Serial1, NEW_RX1, NEW_TX1);
  Serial1.onReceive([&recv]() {
    while (Serial1.available()) {
      char c = Serial1.read();
      if (c > 31 && c < 128) {
        recv += c;
      }
    }
  });
  uart_internal_loopback(1, NEW_RX1);
  delay(50);
  recv = "";
  Serial1.print("SPLIT");
  Serial1.flush();
  delay(150);
  TEST_ASSERT_EQUAL_STRING("SPLIT", recv.c_str());
  TEST_ASSERT_TRUE(Serial1);

  Serial1.end();
  test_serial_begin(Serial1, TEST_AUX_PIN, TEST_AUX_PIN);
  Serial1.onReceive([&recv]() {
    while (Serial1.available()) {
      char c = Serial1.read();
      if (c > 31 && c < 128) {
        recv += c;
      }
    }
  });
  TEST_ASSERT_TRUE(Serial1);
  uart_internal_loopback(1, TEST_AUX_PIN);
  recv = "";
  Serial1.print("SHARED");
  Serial1.flush();
  delay(150);
  TEST_ASSERT_EQUAL_STRING("SHARED", recv.c_str());

  TEST_ASSERT_TRUE(Serial1.setPins(NEW_RX1, NEW_TX1));
  TEST_ASSERT_TRUE(Serial1);
  TEST_ASSERT_EQUAL(NEW_RX1, uart_get_RxPin(1));
  TEST_ASSERT_EQUAL(NEW_TX1, uart_get_TxPin(1));
  uart_internal_loopback(1, NEW_RX1);
  recv = "";
  Serial1.print("SPLIT2");
  Serial1.flush();
  delay(150);
  TEST_ASSERT_EQUAL_STRING("SPLIT2", recv.c_str());
  Serial1.end();

  Serial.println("Same-pin split transition test successful");
}

void rx_pull_setpins_reattach_test(void) {
  log_d("RX pull follows pin changes and setRxInvert()");

  Serial1.end();
  reset_serial_pin_options(Serial1);
  test_serial_begin(Serial1, NEW_RX1, NEW_TX1);
  TEST_ASSERT_EQUAL(GPIO_PULLUP_ONLY, read_rx_pull_mode(NEW_RX1));

  TEST_ASSERT_TRUE(Serial1.setPins(NEW_TX1, NEW_RX1));
  TEST_ASSERT_EQUAL(GPIO_PULLUP_ONLY, read_rx_pull_mode(NEW_TX1));

  Serial1.setRxInvert(true);
  TEST_ASSERT_EQUAL(GPIO_PULLDOWN_ONLY, read_rx_pull_mode(NEW_TX1));
  Serial1.end();

  Serial.println("RX pull setPins reattach test successful");
}

/* Main functions */

void setup() {
  Serial.begin(115200);
  Serial.setDebugOutput(true);
  while (!Serial) {
    delay(10);
  }

  uart_test_configs = {
#if SOC_UART_HP_NUM >= 2 && defined(RX1) && defined(TX1)
#if CONFIG_IDF_TARGET_ESP32P4
    // Using a real ESP32-P4 board requires the broken-out pins of the EV board
    new UARTTestConfig(1, Serial1, 2, 3),  // RX1 = 2, TX1 = 3; ESP32-P4 only: TAB5 (ECO-2) = OK || EV board (ECO5) = OK
#else
    // Non-ESP32-P4 targets should use the regular UART1 pins
    new UARTTestConfig(1, Serial1, RX1, TX1),
#endif
#endif
#if SOC_UART_HP_NUM >= 3 && defined(RX2) && defined(TX2)
    new UARTTestConfig(2, Serial2, RX2, TX2),
#endif
#if SOC_UART_HP_NUM >= 4 && defined(RX3) && defined(TX3)
    new UARTTestConfig(3, Serial3, RX3, TX3),
#endif
#if SOC_UART_HP_NUM >= 5 && defined(RX4) && defined(TX4)
    new UARTTestConfig(4, Serial4, RX4, TX4)
#endif
  };

  if (TEST_UART_NUM == 0) {
    log_e("This test requires at least one UART besides UART0 configured");
    abort();
  }

  log_d("TEST_UART_NUM = %d", TEST_UART_NUM);
  Serial.printf("UART validation: TEST_UART_NUM=%d\r\n", TEST_UART_NUM);
  for (auto *ref : uart_test_configs) {
    UARTTestConfig &config = *ref;
    Serial.printf("  UART%d default RX=%d TX=%d\r\n", config.uart_num, config.default_rx_pin, config.default_tx_pin);
  }
  Serial.printf("  Serial1 alt split RX=%d TX=%d one-wire=%d\r\n", NEW_RX1, NEW_TX1, TEST_AUX_PIN);
  Serial.flush();

  log_d("Setup done. Starting tests");

  UNITY_BEGIN();
  RUN_TEST(begin_when_running_test);
  RUN_TEST(basic_transmission_test);
  RUN_TEST(resize_buffers_test);
  RUN_TEST(change_baudrate_test);
  RUN_TEST(change_cpu_frequency_test);
  RUN_TEST(disabled_uart_calls_test);
  RUN_TEST(enabled_uart_calls_test);
#if CONFIG_IDF_TARGET_ESP32 || CONFIG_IDF_TARGET_ESP32S2
  RUN_TEST(auto_baudrate_test);
#endif
  RUN_TEST(periman_test);
  RUN_TEST(change_pins_test);
  RUN_TEST(irda_mode_test);
  RUN_TEST(inter_uart_pin_move_test);
  RUN_TEST(same_uart_pin_swap_test);
  RUN_TEST(move_rx_tx_to_cts_rts_test);
  RUN_TEST(cross_uart_cts_rts_test);
  RUN_TEST(rx_pull_pre_begin_api_test);
  RUN_TEST(rx_pull_inversion_test);
  RUN_TEST(same_pin_validation_test);
  RUN_TEST(same_pin_pull_disabled_test);
  RUN_TEST(same_pin_transmission_test);
  RUN_TEST(same_pin_periman_test);
  RUN_TEST(same_pin_mode_rejection_test);
  RUN_TEST(same_pin_split_transition_test);
  RUN_TEST(rx_pull_setpins_reattach_test);
  RUN_TEST(end_when_stopped_test);
  RUN_TEST(hardware_flow_control_test);
  UNITY_END();
}

void loop() {}
